{"text":"Best brauts and sour kraut I have ever  had.\n Great to be able to match your beer with your brat, the Belgium waffles look delicious. Fries are excellent and great atmosphere and service! Favorite hot dog\/ brat place ever"}
{"text":"love, love, love this place! they have excellent food and my experience was even better! Olga was our waitress and she was phenomenal, she took time to get samples of meat for us to make sure we got the correct one we wanted and was so kind and quick!"}
{"text":"Great dive bar! Mostly locals with a touch of tourists. Good music and the Cheeseburger on toast with onion rings is amazing. Get the roast beef poboy too... and the firecracker shrimp! So good with a cold beer or anything!!"}
{"text":"my family has eaten here 6 times. Quality and consistency for a great price."}
{"text":"Absolutely love this place. The food is amazing. I always get the same thing: combo karage and pull, soba noodles with mean greens. I can never get enough of this stuff."}
{"text":"My boyfriend and I love this place! We probably go at least once a week. So convenient as well as good food. Definitely recommend the hoagies or wings! Also great that there is a mini market inside for milk, eggs, etc."}
{"text":"Second time here in the last couple of days. Today, they were able to squeeze our 19 girls and 7 parents into an already crowded restaurant. We just finished our first game of the 2015 USYSA Soccer regionals and staying at the Fairfield Inn down the road. These guys are accommodating and they try to cater to all the teams out of town. Tony, our server, has been AWESOME! If you're staying at nearby hotels, ask for the hotel discount. Thanks Tony and staff for they great service and food!  We will definitely return this week to feed our team!"}
{"text":"Tonight was my first time ordering from Flying Pie and I've gotta say I love the variety on their menu! We ordered the Zamboni & I loved the sourdough crust! The pesto was really good with it and the jalapeno added some fun spice. We also ordered a plain pepperoni and it was loaded with cheese. My only complaint was the zamboni was a little on the dry side but that might have to do with the crust. Delicious though and the 1\/2 off the second large deal was awesome!! I'll be back to try the habanero next!"}
{"text":"I was definitely stoked to see a Groupon available for Poppy Kitchen because it had been on my list of places to try since we found out it was opening at the Gio Taco Elite event. You can't really beat $50 for an appetizer, two glasses of wine, two entrees and dessert, especially at a restaurant at the Westin. We really enjoyed the view from the restaurant and want to check out the patio next time. If we didn't already have wine included with the groupon we definitely would have taken advantage of their half price wines on Sunday deal.\n\nTo start we tried the steak tartar but it was really hard to decide on one \"snack\". We definitely enjoyed it but next time I think we'll try something else. After we finished the tartar and ordered our entrees we were quickly brought out what we assumed were our plates but as soon as we looked at them and realized they weren't, the person who dropped them off was gone. We flagged down our waiter and told him we didn't order them so he took them away. Not a big deal, mistakes happen... but then I saw him take the food and serve it to who it was intended for. I don't know much about regulations in the food industry but I don't think it was right to serve food that had already been given to someone else. We obviously hadn't, but they would have had no idea if we had touched it before they took it back. At least we saw our entrees come directly from the kitchen. I had the duck which was really tasty. The skin wasn't as crispy as it could have been but still good. The fried rice was really unique. I asked the waiter what kind of rice they used in it and all he could remember is \"volcanic.. something\" so I'm not sure what they use in it but I liked it. Not your traditional \"fried\" rice but overall had good flavor. I did have to eat around some large chunks of fat from the duck confit though. Fiance ordered the seafood gumbo and although it wasn't much to look at, he devoured his whole plate. It had a nice spice to it, lots of different proteins and the okra on top was a nice touch. As far as plating goes, it might be nice to put the rice on top instead of underneath. The only disappointment with the gumbo was when my fiance found some cartridge\/bone in a spoonful. Not very appetizing.\n\nThe highlight of the night was the made to order carrot cake. It was served piping hot in a small cast iron skillet and topped with a delicious cream cheese ice cream. Next time we won't be sharing one because we were literally fighting over bites! Loved everything about it. Next time I might just order three - one for my app, entree and dessert.\n\nOverall, Poppy Kitchen was good but I wasn't blown away due to a few missteps. I'd like to make it our there again to try a few more dishes, sit on the patio and have that delicious carrot cake again. I also believe they recently started a Saturday brunch - I'd like to see the menu for that and possibly check it out."}
{"text":"Great atmosphere, good service and the mediocre food is pricy for what you get.\nWe were turned off by FOX news being shown. It's bad for business. Put sports, HGTV or something neutral. \nWe are locals and often have visitors we like to take out. It won't be here as not to offend anyone.\nThey did a great job on the outdoor patio."}
{"text":"I thought the food was awesome, and the cookies and cream shake is to die for. the service tho was sub-par. when we order it normally takes 15 mins to get anything, which is confusing because its set up kind of like a fast food place, but is not clearly. everything also comes out at different times which is not like a restaurant nor a fast food place? so im not sure what theyre trying to accomplish, the people working honestly seem like they absolutely hate their job... burgers are great tho"}
{"text":"Michael Somolov doesn't disappoint! From the chef that brings us Zahav, Goldie has a bit of a reputation to protect, and it definitely rises to the occasion. \n\nI had heard about Goldie a while back and had the spot bookmarked to definitely try. I was finally able to get to see what all the fuss was about (better late than never right? haha.) \n\nGoldie is located just on the outskirts of Rittenhouse Square, so parking is going to be a bit tough. I had to park about 10 minutes away, but that's probably par for course for anything located in this area. Many of the Yelp reviews mentioned that Saturday lunch\/brunch hour is packed, and I naively planned exactly for that timing. Fortunately, there wasn't too much of a crowd when I walked up (woot woot!)\n\nThe menu is simple, but the quality is there. Basically the menu has falafel (yes), vegan \"milk\"shake (double yes), and fries (triple yes) - honestly just order the whole menu! I ordered the Turkish Coffee milkshake, made vegan with almond milk, along with the fries seasoned with shwarma. What a delight! The shake was nutty, and had hints of mocha, perfectly supporting the coffee flavor. The fries were crisp, and seasoned perfectly - spicy but not too much that the familiarity of potatoes is removed. It's that perfect combination of fries and a shake, elevated and twisted all in the right direction.\n\nThe space is small (especially given how popular it is), and it is longer than it is wide. Definitely a place to take your food to go. If that is not your plan, there is seating - maxing out at probably 20 people (including the bar area by the window.)  \n\nI'll definitely want to come back for a falafel and make this my go to spot for many a lunch hour. Keep doing you Goldie - a new standard has arrived!"}
{"text":"Amazing cheese fries and chicken tenders. Definitely better when stopping there after a night out."}
{"text":"I always like the food options that keep popping up in the city. This place opened up a couple of blocks from my house, it used to be a Sun Ray Grill. Now, it's a cool little sushi place with a grill, too.\n\n\nI had two of the rolls, I'm not sure which ones there are so many. I thoroughly enjoyed them, and they are prepared on the spot.\nMy oldest child wanted to try sushi, and ate parts of it but didn't  eat the whole thing, but he seven. My daughter who is almost 4, just wanted chicken and fries. They had no problem getting that out.\nThe prices were expected and not beyond reason at all. Service was efficient and kind, and even the resident regular was helpful when he gave the mussels a thumbs up. He was right, too.\n\nI'm definitely going back, and think its a nice addition to our little Old Metairie neighborhood."}
{"text":"Sooooooo, we just \"ate\" at Villari's Lakeside Restaurant & Lounge. I don't even know where to begin. The bread was hard as a rock to the point when my husband knocked it on the table, I thought it was his phone. Ive seen Much more appetizing salads come from a pizza place. We were sitting there for quite awhile, thirsty, after about 10 minutes my husband had to go to the bar to get our drinks. In case that wasn't bad enough to start, the couple next to us was smoking which I didn't even realize was still a thing at \"restaurants\".   The entrees finally arrived. I got macadamia crusted salmon with arugula salad and risotto. I'm pretty sure my risotto was yellow rice, someone must've dumped an entire salt shaker over my whole plate because I couldnt even eat the arugula, and the salmon was less than mediocre. The only reason I ate it was because I hadn't eaten since 1:30 and was starving. It was a Miserable experience. I went to the manager, who never gave his name, and explained we were there for my birthday and what all had happened and he asked who our server was and I said the food was so bad I was going to go home and have a bowl of cereal since I was still hungry. He just kind of shrugged offered me a drink and said thanks and happy birthday. We will never be going back and I would never recommend it to anyone."}
{"text":"Delicious gourmet burger and Belgian frits."}
{"text":"My family ordered food today and it was very good.  I ordered Alambre and I'm a big eater and I could only eat half of my meal.  The dish was good, but it could use more seasoning.  My wife and daughter also enjoyed their meals and I tasted both and thought they were good.  The salsa included was small, but their salsa is good.  I liked the portions and we will eat there again in the future."}
{"text":"I was actually surprised to see how unimpressive this place was after hearing reviews from coworkers. We arrived fairly early on a Saturday night, approximately 5 PM. The place only had 4 to 5 tables full. We were told that our pizza would take 45 minutes, and it ended up taking close to an hour. The free breadsticks are nothing more then cooked bread without much flavor. When the pizza came, it was tough and nothing special. The price was pretty expensive, and the place was fairly dirty. Needless to say, I will be choosing something else from here on out."}
{"text":"Great spot but makes you wait forever to take your order and the food will take YEARS to Arrive"}
{"text":"My husband and I with our daughter decided to try the Claim Jumper here in Reno. We were not impressed. From the very moment we entered the restaurant it was pretty bad. We waited for someone to greet us for almost 8 minutes, and when someone finally said anything they said this-\"Have you been helped yet?\" Us- No not yet.\" \"Okay well wait a few minutes longer.\" Us- 0.o? It wasn't even busy.\nAnyway we finally got seated and our server was very nice, but she was kind of slow and rarely came to our table-but still she was the only redeeming quality due to how nice she was. The first table we sat at had a horrible flickering light so we had to flag her down and move to another table. The table was sticky and unclean. I had to use wipes from my purse to clean off the surface. Our food came and was cold and bland. My husband ordered the filet and lobster and the 7oz filet looked like a 2oz wad of meat. The cheesy garlic bread was uncooked and tasted horrible. And lets not talk about the cesaer salad. Ugh.\nI actually came home and got sick. All I ate was a Turkey sandwhich with avocado and it made me really sick. \nDue to the lackluster experience and terribly bland and unexceptional food we will not be coming back to this establishment. I have not been to a CJ in years and after reading that they have changed ownership, and since the change they've gone downhill it shows. For the price you should have a far better experience and we did not receive that at all."}
{"text":"If you're looking for a place to relax and decompress Simply Thai's welcome atmosphere is perfect. The simple, elegant environment provides a quiet ambience where intimate dining and conversation can flourish. Perfectly delivered food. Gentle, mellow staff give way to an awesome dining experience. What more could you want!"}
{"text":"Well. That was disappointing. After seeing photos and reading some great reviews, we decided to pop in mid afternoon for a drink and a snack. We sat down at the bar and it took Peri the bartender 10 minutes to acknowledge us, much less hand a us a menu. \n\nWe ordered two waters and an old fashioned. It took 15 minutes to get waters. He made an old fashioned, set it down in front of us on the rail, and left it there for 15 minutes. Eventually I assumed it was mine and reached for it and he snapped at me. He finally made my drink after 20+ minutes and it was bad. \n\nThe bar smelled, the staff was rude, our waters were almost never refilled, the food was overpriced and mediocre at best. There is no shortage of great food and drinks in the city. Skip this spot."}
{"text":"4 stars for food\n3 stars on overall experience\n\nLots of comparisons to Jong Ka Jib, my take is that they are very different styles.  Jong Ka Jib tastes light and clean, flavors are subtle and it seems more soupy.  Du Bu tastes heavy and dense, like sensory overload. A much thicker consistency. The flavoring was excellent though.\n\nWe went on a Sunday for a late lunch. They had a play room up front for kids which I guess encourages families to come.  There must have been a large gathering in the back room because there were probably 7-8 kids running wild all over the restaurant. Keep in mind that there is piping hot tofu soup being served and it just doesn't seem like a good idea. Neither wait staff nor manager made an attempt to keep the kids from running around and screaming all over.  Also due to the layout of the seating, wait staff have to walk in large circles to serve food so the wait staff all seemed to be running around as well.\n\nAll in all just felt like a very hectic\/chaotic experience. \n\nFood is a toss up depending on what style you prefer but I much prefer the peace and quiet of Jong Ka Jib."}
{"text":"There isn't a better place in Idaho to get a beer. Lots of choices from all over the country and the world."}
{"text":"Food was terrific, beers were cold and the service was top notch.  I would definitely recommend this place to any friends or family."}
{"text":"Great pizza. Great service. Good prices. \nmy favorite pizza in the area."}
{"text":"First, I can't rate the restaurant on their food. After waiting 19 minutes (yes 19) for a menu or even a server to come to see us, we got up and left. It should have been a sign when the hostess was fumbling around and was so flustered trying to seat people. That process was 7 minutes. (That would have been fine if it was a peak time, but the entire restaurant had less than 25% customers. And it was 7 pm at a logical dinner time.)Then after walking to our table, we sat for an additional 19 minutes. No menus. No service. Noticed one of the patrons getting up to grab a pitcher of water to fill his own cup and grab ketchup. That sealed the deal. We left. No wonder they are struggling. I'm terrified of how their kitchen is run if the front of the house operates that way. STAY AWAY. I would have given zero stars if it was an option."}
{"text":"Excellent and authentic and warning, they do NOT accommodate people who can't handle spicy. Kinda like the soup nazi. Tried it a few times and can't stand paying for pain."}
{"text":"Slow service but good food. Most of the tables were empty and still servers asked us to wait for 40 mins, it was around  11 am on a weekday. We had crabmeat cheesecake and it was delicious."}
{"text":"The restaurant interior design is really clean and modern. Very nice atmosphere! \n\nGreat selection of beer. Came in for happy hour and although the menu for it wasn't vast, the food (I ordered ceviche) was tasty & well presented on the plate! \n\nI'd recommend!"}
{"text":"Look, all I have to say is Kumo is a heaven sent sushi restaurant. Place was one of the only affordable take out sushi places available during the COVID-19 quarantine. Even now, all this time later, their prices and deals are unbeatable, all while not sacrificing quality. I have been ordering from here for over 7 months now, and it will continue to be my takeout spot of choice! I love this place!"}
{"text":"It was good, not super spectacular as I was expecting.  I believe though what made it drop in rating for me was the lack of any type of modification available.  For example, I ordered the shrimp and grits, which comes with two eggs on top.  I wasn't completely sure I would like this so I asked if I could have my eggs on the side then I could try it on top, (if I liked it...YAY...if not...I already know I like shrimp and grits so we are golden!!) The answer was \"no, they won't do it that way. But feel free to take the eggs off yourself.\")  After being slightly taken aback, I ordered it anyway.  It was very good. However, I don't eat green peppers and the gravy for the sauce was full of them.  I waited for our waitress to check on us (did not happen) finally after my husband had finished half his food (which was wonderful) I flagged down someone to ask for a side of biscuit gravy.  The answer was \"I'm not sure if you can.  I'll ask.\"  At this point I was confused.  I did not wish for free gravy.  I'm unfamiliar with restaurants not allowing customers to order items.  Eventually, I was \"allowed to order gravy\" (a small bowel, $3)  after I offered to buy a side of biscuits and gravy with no biscuits.....all the while my breakfast is getting colder.  Overall, I won't be back.  Philly has lots of super options for food in which I can order, and pay to get something to eat without it being a hassle. Additionally, our water was empty and not refilled.  My coke was refilled by flagging down a sweet man bussing tables."}
{"text":"The food is not the same is disgusting, it was good at one point and for some reason is not same , A couple of my co- workers were very disappointing and will never go again."}
{"text":"WORST MANAGER, Ms. Shirley!!!! My husband ordered the red beans and andouille sausage, a friend ordered the shrimp creole and both came with very dry, crunchy rice. Both were sent back to the kitchen to come back the same way. My husband is allergic to shellfish so his choices are limited in this restaurant. We spoke to the manager and as she rolled up said 'What's the issue?!' No hi, hello, sorry for the bad experience...no courtesy whatsoever. Overall the worst attitude for a manager that runs a restaurant, and not a cheap one, to not show compassion or consideration. Honestly, the food was not great. You're better off going to a cheaper place to eat.\n\nAfter this review and an email to the general manager, we came back to Royal House to give them another try. Michael, thank you for amending the bad experience and turned it to a great ending to our trip and my husband's birthday. We appreciate you. The food, drinks and desserts were amazing. Tina was a very attentive and wonderful server."}
{"text":"The wait staff are friendly. Coffee was flavorful. Had the Eggs Benedict with House potatoes. Perfectly made. In love with this place. Diner atmosphere. Very reasonable. Great for family Breakfast."}
{"text":"The BBQ crawfish and grits was delicious ( I don't usually eat crawfish). The sweet potato pie was unbelievably  delicious."}
{"text":"Came in for the first time with the family after church for lunch, food is good but lacks more flavor. I got Menudo and was not what I expected, same goes for the Orchata. My wife had enchiladas and felt the same way. My kids really liked their food. May be because we are from Mexican backgrounds, we were expecting more traditional flavor. Overall, we are happy to have a Mexican restaurant in Connerton!"}
{"text":"Authentic soul food!! The fried chicken was so juicy and flavorful. Food was cooked to order so it came out hot and fresh. Mac and cheese had a little bit of the New Orleans spice which was different but still yummy. I would recommend all tourist to eat here but beware of the wait. Fortunately we skipped breakfast and arrived when they first opened. Don't miss out on trying the \"World's Best Fried Chicken\"!!!"}
{"text":"For only being open six weeks, Adele's is off to a good start!  Service was great, server was knowledgable about the wine, and the outdoor seating was lovely.  We started with the kale salad, which was too salty. My husband, who loves salt, agreed that it was over the top. It has tiny bits of bread crumbs, peccorino cheese, anchovies, and salt crystals mixed in, and it could use something sweet to offset the salt. (Honestly, the Tavern has the best kale salad in town.) I had the chicken based on everyone's rave reviews and it was HEAVENLY: flavorful, moist, and a crispy skin.  Fabulous.  It was served on a small bed of kale but the kale was so drenched in oil that I didn't bother.  This chicken deserves an equally glorious side! Power to the chicken!  My husband had the ribs on polenta and it was over-the-top delicious.  Peanuts are cooked in a sauce that imparts an earthy flavor to the entire dish. The ribs fell off the bone and the polenta was a perfect accompaniment. I kept dive bombing his dish because it was so great. I had a coffee after dinner which was served with skim milk and a place like this should have half n half.  Prices were fair based on the quality of food and we look forward to returning!"}
{"text":"Great diner food. Surprising menu which is greatly expansive compared to the name. Very casual environment. Went on Sunday around noon and it was very busy. Service was great-drinks always filled and they had many servers to handle the crowd. I love the mix of traditional american food with mexican. The Mexican breakfast burrito and quesadilla were great. They come with rice and beans on a gigantic plate. The kids menu for beakfast is affordable and plentiful. Kids chicken fingers seemed pricey ($6.50). For two adults and a child our meal was $26 before tip. The people next to us got the burger, which looked equally as large and yummy. Good mix of people, all ages, students, families, etc."}
{"text":"Great brunch. Bloody Mary bar, should I say more? I even took a go cup walking with me. The waiter and the hostess was super nice. I had the duck hash and it was sooo good. The mix of savory and sweet with the fruit was the perfect blend. I also love the unassuming inside that makes the food the highlight of the place rather than its decor."}
{"text":"Sports Bar and College Vibe aside, Cooter Browns has some of the best food in the city.  First off is the cheese fries, which I noticed other people have posted about.  While cheese fries in various New Orleans locations can be a big debate, I think Cooter Browns disc fries with mix of cheeses on it is the best around.  The extensive list of \"Phillys\" on the menu mix the New Orleans Po-Boy style with the Philadelphia Cheesesteak - on french bread, with provolone cheese, onions and peppers and meat of your choice, ranging from alligator sausage to shrimp (or get the Bayou Philly for both).  For a carb explosion, try the crawfish pie po boy, perfectly seasoned with remoulade sauce.  \nThe food can sometimes take a while to be ready, but you can grab a beer, take a seat and watch one of the 5 televisions featuring any important sports games on at the time.  Be careful to survey the tee shirts of the sports-crazy crowd before rooting for a team.  Some people can get very intense."}
{"text":"As a native New Orleanean, I am picky about my Cajun food and holy goodness I want to eat here all the time.  It's so good!  Their customer service was awesome. We were greeted when we walked in, offered samples and our food was ready pronto.  They were genuinely interested in our experience and wanted us to leave happy (and full).  Oh, and they give you this sliced French bread with this seasoned butter yumminess that's so good you'll want to slap ya mama.  Oh man that was good.  I got a plate half with jambalaya (spicy! But not too spicy) and half with crawfish étouffée.  They name their étouffée something weird but it's just yummy étouffée.  My husband got a plate half with drunken chicken (\"awesome! It was great!\") and black beans and chorizo chili (\"it was black beanaliscious\").  Both were very yummy.  Yum yum yummy yum.  The end. #nomnomnom"}
{"text":"We really like this place. The food is fresh and tasty. The prices are reasonable. The people are super kind. We have followed some of the family who operates this place from their old restaurant at the Parkcenter mall. The sandwich is great, the kabobs are great, the rice is stellar. The soup is a true experience. The only glitch, is the handmade crab rangoons are $1 each and small. If they want a buck each, we are good with that, but increase the portion size!"}
{"text":"My family and I have gone to this location 2 times over the last couple months and this is the worst service experience we have had both times.  First, they never get our orders right and then the employees make it worse by making smart was comments in ear shot and making us feel it's our fault that their food isn't ready.  Second,  they never said that our food was ready and get this this is the clincher, there was only one other customer that came in behind us and a lady that walked out the door with her to go order.  So folks they were not busy and they hadn't been on both occasions.  I have been a Carmel resident all my life and it's nice that there is a location here on Carmel.  I believe in giving places second chances that maybe it was an off evening or the benefit of the doubt.  But to be treated like crap in front of our 7 year old son I won't tolerate and we are never going to that location again.  We went on Saturday night 1\/13 at about 6 in case management cares.  Which I highly doubt they won't.  30.00 for terrible service and a miserable experience... awesome."}
{"text":"We picked this place for my wife's bday party for a group of 16.  They had no problem accommodating that many people in their restaurant.  The staff was very attentive and did a great job with our party.  The food was really good!  I am excited that we found a place that serves plantains and yucca root.  I would recommend this place to my friends and to anyone wanting to try something a little different."}
{"text":"I have eaten at Seasons several times and am especially happy about their BOGO salads on Tuesdays. The food is fresh and tasty. Service is usually good, the server pleasant and enthusiastic. My only objection is that our server sported a very strong perfume scent which was offputting. In fact, I may not eat in-house in the future because of it and just get takeout."}
{"text":"The food here wasnt that great. Since its the only place open at 11.30 we went here. But the food was much below average. They need to make their food worth the money they take."}
{"text":"Going to a restaurant only days after they open is always a questionable choice but boy am I glad we did!  El Pavo Real opened on South Broad across from the Rosa Keller Library last week and they are making waves in Broadmoor!\n\nWe found the service friendly and the speed just fine.  They brought spicy popcorn with our drinks and shortly after the tamales we ordered to start.  The tamales were dark and perfect.  I'm not a mole fan but it was served on the side and my wife said it was lovely.\n\nShe ordered the chicken enchiladas as her entree and found them lovely.  Cheesy in a red sauce and very flavorful.\n\nMy carnitas plate was the highlight of my day. Melt-in-your-mouth tender.  Absolutely delicious and beautifully presented.\n\nAt a very affordable price Broadmoor will be keeping this new gem hopping!"}
{"text":"Date visited: Jan 22, 2009\n\nEvery time I return to Ragazzi (or Pizza Boys) as they used to be called, the place is busier and busier. I'm happy for them, but I do show up hungry, so waiting is tough! But usually I'm leaving happily full, and at times even uncomfortably so; hence it's no big deal. But there was no happily full departure this time; there was just departure. I left due a long wait, and the bad energy associated with a bunch of people that have already been hungry and waiting too long. \n\nI eavesdropped to find out it was due to a great newspaper review. So I thought I would add to their problems by writing another great review! Well, not quite! When I did check to see if there was one here already, and I was shocked to find that there wasn't. \n\nBecause people that love thin crust pizza should really know about this place. I have tried many of the choices (with the traditional Margherita topping the list), and have never been disappointed with the quality. The Volare hand-tossed crust is definitely something these boys have mastered. And I love the fact that they have Italian beer to go with the flying pizza. So, go! But not quite yet... Give them some time to hire extra kitchen help and wait staff. Although, they may have to import them from Italy. These pizza boys are actual ragazzi (which means guys in Italian). They yell in Italian at each other and a waitress (that I can only imagine is part of their family), and I can bet their Mamma helped them decorate (it's the light fixtures that give it away). Authentic and thin crust tasty... No wonder there are crowds."}
{"text":"-1 star only because I wish they served nigiri sushi so that I could eat something without rice, but I understand that this is just not what they do.\n\nOther than that, I love this place. The staff are always friendly and efficient. I can eat my food first with my eyes because the presentation is good. Food is always delicious and I can have as much wasabi as I want, which is always alot. So glad they are there because when I am hungry and want good quality sushi now it's always there for me. \n\nYum!"}
{"text":"The chicken was good. Better than I expected. The fritters were ok. I'm not a Cole slaw lover but theirs was fine. Mashed potatoes were ok. Nice place, seems like good is made fresh. Decent prices.  I'd go back."}
{"text":"Very nice restaurant! The calamari sauce was fantastic! The meals are a bit pricy but they are very good. The music was at a good volume and the scenery is trendy. I would recommend to others."}
{"text":"Truthfully I didn't expect a whole lot walking into this place...  It is very small and seemed more like a pizza place where you would mostly stop by for takeout.  But I was wrong!  Was lucky to be treated to a wonderful lunch here by my boss for the holidays.  The service was great!  The food was phenomenal!!!  Perfectly cooked, wonderful pastas, delicious sauces and salads.  Hope to go back again one day soon!"}
{"text":"My boyfriend and I came here for my birthday weekend in Nashville and we were very pleased! The Peared Sake was AMAZING and all three sushi rolls we ordered were fresh and wonderful. We will definitely be back next time we are in town."}
{"text":"I was excited to hear something was finally going in the old Casa Corollas lot. Another diner was even more of a bonus. We visited opening week and the place was beautifully done. It had a greats nostalgic diner feel, but new and clean. I had the chicken gyro. The service was fast and friendly. Sadly the food was not good. It almost tasted like the meat had been microwaved. I would go back and maybe stick to the breakfast menu from now on. Prices also seemed a bit high for diner food and what's you get. I understand it's Marlton but still..."}
{"text":"Delicious!!! After my friend and I checked into our hostel in NOLA, we asked for restaurant recommendations. We were surprised the first place our host recommended was a burrito place... Burritos are not at the top of my list for foods to eat in New Orleans. But it was really close to where we were staying, so we decided to try it. Then ended up coming back 3 or 4 more times during out 10-day stay.\n\nThe prices are really fair and the veggie options are fantastic. I eat seafood but not other meat, and my friend is completely vegetarian. Classic New Orleans food is delicious, but it was really nice for me to get a break from the endless fried seafood and get some much-craved vegetables in me. And it was really nice for her to get a break from salad and the occasional veggie-burger.\n\nI got the Super Green burrito (with dairy) and added black beans. It was messy and delicious and healthy and satisfying. I could eat that burrito every day. Oh man, I want one right now. \n\nI tried the Sweet n Green quesadilla, which was delicious as well, but not as mind-blowingly so as the Super Green. They've also got bottles of Abita at a decent price.\n\nThe servers were super friendly and recognized us before too long. I also thought the light fixtures were really cool, and I did my best not to take photos of them like some crazed tourist. The green tomatillo sauce was really good too - my friend was obsessed with it. They should have charged her for it because she likely went through an entire bottle."}
{"text":"Stopped into this place for a quick dinner during a business trip. I had the tomato soup bread bowl. The soup was amazing! It had great flavor and the perfect amount of thickness. They used French bread for the bowl which was a little different, but it was still pretty good."}
{"text":"What a wonderful diner.  Being from the New York area it is a taste of home. The staff is cheerful and more importantly very attentive.  No room left for dessert so we will have to stop by again just for this. I hear the brownie is amazing.  If you are lucky enough to have Henry as your server the experience will be a treat."}
{"text":"Quick smoothie place. Pretty liquidy smoothie but the taste was good. How's the food here?"}
{"text":"We visited La Trattoria last night my mother In law's birthday dinner. Cute little local spot in Greenwood. \n\nParking is limited & the wait for a table of 6 took a little over an hour to get a table. \n\nBut the food was delicious and the service was A+\n\nAs a table- we shared the mushroom appetizer, meatballs, and potatoes. We all had a steak entrees (comes with a side salad and pasta). \n\nEverything we had was high quality and delicious."}
{"text":"My fiance and I first ate here not long after they opened, and we love a good burger, so whenever a new burger place opens up, we're there. We'd heard tons about Five Guys. but never wanted to drive to the Park to check it out. I'm glad this one opened up. \n\nHe got a double, I got a single, and we topped them as we saw fit, splitting an order of fries. I must say, the burger patty itself was divine. The bacon was crisp but not burnt, so I didn't have to chew through it when I took a bite. I like the grilled onions, as well. It was a nice touch. \n\nI liked the fries. Ours were fresh, hot and perfectly done. it does suck that people with a peanut allergy miss out, but if that's the way they make them, that's the way they make them. People with severe peanut allergies be warned: there are open sacks of peanuts everywhere, and I have friends who wouldn't even be able to go into this place, so that's a minus.\n\nYes, you are going to have to wait longer for food at this place, but they make it fresh. Better \"fast food\" isn't going to be sitting under a heat lamp and available right away. If you like your food instantly, this is not the burger place for you. If you want it to taste good, give them a try.\n\nI don't mind the \"take out bags for all\" approach. It streamlines the process a bit at the cash counter. \n\nI didn't like the selection of drinks. We're not pop drinkers, so having a choice of shakes or something would be nice. I also don't drink remineralized water, which is all they had (I like my water without added salt thanks). The cheese could use some improvement. It was very processed, and I don't think processed cheese adds to a burger. The bun could also have been bigger, as someone else mentioned. For those little reasons, they lose a star. \n\nWe've also taken out, and they food survives fairly well on the ten minute car trip home."}
{"text":"This is a fun little spot in  Ballast Point Park.  You can sit outside and enjoy the water in Hillsborough Bay and watch the fishermen. \n\nThe fried shrimp is very yummy!  They don't serve alcohol yet but say they are working on it.\n\nWhen done eating, take a walk down the pier!"}
{"text":"Some of the best French fries I've ever had. Friendly and prompt service. Nice place to have a few drinks and a bite to eat."}
{"text":"This pizza, atmosphere and owner are all amazing!  This is The BEST pizza in Wesley Chapel!  The pizza is just like what you would get up north!  Salads and pasta are to die for.  The owner is an absolute gem that raises his hand to continuously help in the community!  I love this place and it is one of my favorites!"}
{"text":"Since moving to Dunedin, we were told about the Black Pearl for special occasions, and made a reservation for our Anniversary. \nBlack Pearl lived up to the hype and recommendations! Very intimate interior, and with Covid restrictions, even more so. Make reservation early! \nOur dinner was superb! Wine selection is fantastic and we chose well. \nWhile we both enjoyed steak, everything looked delicious and I would be hard pressed to believe you wouldn't enjoy it. Absolutely will come back and way before a special event!"}
{"text":"The Cochon is DELICIOUS!!!! We had the cochon and and seafood Benedict. The cochon is the winner. I liked the shrimp and grits a lot. The Bloody Mary was delicious and I am not a Bloody Mary drinker. The pancake was good too. Make reservations, it was packed!"}
{"text":"Alyssa is legit the best bar tender I've ever met! She's super sweet and takes such great care of my people and I! She makes me feel welcome and loved. And the food is the bomb.com. Definitely recommend. 15\/10!!!"}
{"text":"Excellent place for lunch or dinner. The salmon was excellent...very fresh...melts in your mouth. Late Harvest Riesling was a great compliment to my meal. Could do with some lighter background music."}
{"text":"My wife and I love calypso cafe. We are there once or twice every couple of weeks. I usually get the black bean salad with chicken. It is a huge meal (a dinner plate full of lettuce, chicken, black beans, tostitos type chips, onions, and tomatoes) which comes with their kinda spicy, kinda liquidy, barbecue \"sauce\". That is my favorite part of the salad. I don't like salads and, at first glance, it looks unappealing to me because, well, it's salad. Upon digging in and tasting it, I am a believer. \nWe also always get a side order of their boija muffins as well. They are a sweet cornbread type of muffin with coconut on top. The coconut isn't overwhelming, but there is enough to give it the flavor. \nMy wife typically gets the beans and three and loves their sweet potatoes and black beans. \n\nAnd the fruit tea. I would come here just to get cup of this stuff to go. It seems to be iced tea with orange and pineapple juice mixed in. Very good. \n\nAfter tax and tip, for the muffins, salad, beans and three combo, and 2 drinks it was $25 for 2 people to eat and get VERY full."}
{"text":"I've lived in Bordentown for a good majority of my life. This place is awesome! They staff and bartenders are very friendly, there is always something going on whether it's game night, karaoke night, live music...always something to do for this quaint town. The food is amazing! I love the roast beef sandwich...always a good place to hang out with friends and they are always serving both drink and food specials. I would absolutely recommend this place to family and friends...although we all go there as it is haha!"}
{"text":"I had a chicken salad sandwich here today for lunch, and it was fine. On my last visit, I was disappointed to see how much styrofoam they use. I would like to see them transition to using paper plates and paper cups. But, when I mentioned that I did not want any styrofoam, they were happy to either give me a real plate, for dining in, or wrap my sandwich up in aluminum foil, to go. Please consider asking them to reduce their use of Styrofoam."}
{"text":"Food was good but beware of peanut allergy\n\nI went to the restaurant yesterday for the first time wanting to eat dim sums. I ordered wonton egg noodle soup which was big portion and good. Orange chicken was ok. The dim sum was really good. We asked if food (dim sum) has peanut and the server said only one. We did not order any peanut allergy food and also let our server know. We enjoyed our food for a while. 15 minutes later, my son said his lips were swollen. We came back home and gave him Benadryl. He had other symptoms too (stomachache, stuffy nose). Luckily we gave him medicines fast enough and maybe the peanut was not a big portion. It can be that they use the same utensils when cooking but I don't know. My son had to lay down for many hours and have an extra dose of medicine a few hours later. \nI hope the restaurant will be more careful with peanut from now on."}
{"text":"I loved my meal here. The staff was very friendly and full of good suggestions for first timers."}
{"text":"So you see that \"corporate person\" apologizing & willing to talk an make up for the problem on my first review? SHE NEVER RESPONDS!!! \nSuch crap!!\nTYPICAL CORPORATE LIES!!!!\n\nDO NOT EAT AT HOOTERS!!!"}
{"text":"Finally, a Middle Eastern restaurant in Dutchtown! And it's quite good, too. I had a simple takeaway lunch of hummus and  a gyro. Both were fantastic. The hummus, like Vikram said, is creamy and full of citrus, with a healthy dollop of olive oil. Their amazing bread is perfect for scooping. The gyro is generously filled with peppery, slightly spicy gyro meat and tzatziki sauce. I only got through half the gyro before I had that unbutton-my-pants moment. One of my friends swears by the sharwarma, so that's coming up on the next visit. \n\nThe space used to be an art gallery, and Sultan's Palace takes up 2\/3 of that original area. It's a large dining area with quiet decor. Parking can be challenging during the day, but do not let that stop you from visiting!"}
{"text":"I gave this Pizza Hut another try because it's the one that will deliver to my house. \n\nThe delivery driver was a really nice guy and he was fast. It arrived 15 to 20 minutes quicker than the time I was given. \n\nI ordered online this time with them & got my nephew the Cheese Lovers with bacon-stuffed crust & pepperoni. We checked the \"extra cheese\" box which was a little confusing. If you get the Cheese Lovers, it will already have extra cheese so don't check that box unless you want to pay for even more cheese on top of that. My nephew seems to be happy with the huge amount of cheese though.\n\nAs you can see in my photos, the pizza looked pretty sloppy. It must have slid around at some point during transport. Some slices are missing toppings on half of the slice because it's stuck on the bottom of the others that were lying on top... The box was really greasy as well.  It appears to taste good because he's scarfing it down, but, still, if I have a choice, I prefer the 10th Street location. \n\nHe is telling me right now that it is extremely salty. That was an issue last time we got a pizza at this location.\n\nI was going to go up a star because the driver was fast & friendly, but he may be the reason why the pie was all slid on top of itself. Leaving at two stars for that messiness, the grease & salt."}
{"text":"I have an opportunity to visit many restaurants in my travels throughout Pennsylvania, having some close friends in Royersford, hard to find some decent places unless you head to KOP or Philly or even to the Lehigh Valley. \n\nI have eaten at this establishment 6 times, all takeout. Food is actually good but the following is a MAJOR problem, also taking into account COVID issues. \n\n1. Arrogant management - you give an honest opinion, you get \"It is what it is\" - pretty stupid in the restaurant business \n\n2. Attention to detail - The majority of the times I have called you need to explain 5 times to those answering the phones and the order is still wrong, I am talking East stuff. Young kids - don't listen or pay attention, get some better help. Maddening and like talking to a 5 year old. \n\n3. Pickup - understaffed and this place takes way too many orders, over promises and under delivers, basic plain pizza - they tell you 30 minutes and it is an hour. \n\n4. Lines - like you would not believe to just pick up a pizza and the staff is clueless. \n\n5. Irate customers and have seen arguments outside due to the disorganization and lack of parking at this establishment. \n\nAdvice from someone experienced and working in the service industry: \n\nGet your act together, hire people with a brain, get organized, stop screwing up orders and lose your arrogance and sense of entitlement - you are not the only game in town and piss enough people off, you will be gone. Your food is not that good...."}
{"text":"I am confused by some of the other posts on this site, & glad that I read the reviews on others (or I probably would have never tried it). Le Gourmet is beautifully decorated, I love how they used the old bank vault as their walk in. The kitchen is open, so you can see everything that goes down behind the scenes. On our first visit the Chef\/Owner Nadhir came over to our table to see how everything was (I never had this happen at another restaurant). The food was awesome, the waitress was helpful when I was stuck between 3 different dinners. After about 5 visits, have had breakfast lunch & dinner (all wonderful) I decided to use them to cater a party I was having. Nadhir met with me and gave me a few options that fit my budget. I chose an assortment of picky foods, all great I especially loved the stuffed grape leaves & Lauren salad. The desert spread was also out of this world!"}
{"text":"I walked in and they were less than busy. 3 tables with the largest having 4 people (2 children, and 2 adults). I am a very patient individual having worked in the service industry I get it, but to be standing at the \"please wait to be seated\" for 10 MINUTES without any acknowledgement was a little off putting. I finally spoke and said \"Can i just sit anywhere\" and they looked at me and said oh yeah.. sat down and the wait staff were terrible. not a steak 'n shake id go to ever again."}
{"text":"Rounding up from 3.8 perhaps but it's all positive.\n\nHad the opportunity to eat dinner here this past week with several other friends. Attached to a local mall, and accessible from the outside, the  restaurant was clean, open, filled with numerous multichannel stations on, and the service was very good. The waitress readily explained all of the 'Louisiana Kitchen menu specific language in a playful manner.\n\nThe variety of menu selection was very good and when the food came out in excellent time, each of our meals was distinctive and tasty from the rice to chicken to cheese bites and so on. As most adults have experienced over time, regional food tastes served out-of-the-region are susceptible to either too much seasoning, too strong, too spicy, too salty, etc., or too bland, but this kitchen did it right."}
{"text":"This review is long overdue. My husband and I found Ocean soon after it opened and I have been regulars ever since.  We've tried almost everything on the menu and have never been disappointed. Their sushi is always fresh and they are happy to customize rolls if you want, including substituting brown rice. Also there are several items not on their menu that were specials at one time and they will make if you ask. Our favorite specials are the sushi pizza and the salmon spoons.  Aside from the sushi we have had their avocado salad, pork gyoza, general tso chicken, snapper, Thai basil chicken, grand mariner shrimp, tropical fried rice, and too many other dishes to name, but they have all been very good.  The service is exceptional.  Queenie, Danny and Pierre always remember how we customize our food even if we ourselves forget! The decor is upscale on modern, and the place is always spotless.  This is definitely the best place in the area for sushi and Asian food!"}
{"text":"Out of control delicious!! We had a vegetarian dish and beef sampler. Every item on both dishes were delightful. We then shared a cashew and pistachio baklava and they were divine also.\nI highly highly recommend."}
{"text":"I really like this place. The food is really good we had four rolls and two hand rolls. The price was average for good sushi. The only thing I had issue with was the service, the girls were all sitting at a table looking at their phones and talking. If I owned this business my first rule is NO PHONES!! They were very nice just preoccupied with socializing with each other. Our food came out fast but was missing the appetizer. When I asked about it she just seemed like it was no big deal that she did not put it in. Nothing here that could not be corrected by management. They could get that fifth star easy!!! I will go back like I said the food was really good."}
{"text":"I highly recommend it is the best place for all seafood fans to go. I love the king crab legs, seafood salad and the raw oyster... Excellent, friendly service and quality foods. Yummy!!! :)"}
{"text":"I continue to go to China King on a fairly regular basis. These kinds of Chinese Take-out places are pretty common; China King is generally pretty good, with one exception (see below).  My son always gets the General Tso Chicken combo. I try various dishes but get the Mu Shu Pork most often.  I haven't had anything bad yet.  It's pretty standard stuff, but dependable, and the kids who often help out at the counter are nice.\n\nHowever, the egg rolls aren't very good - there just isn't enough filling and I feel like they are mostly fried wrapper.  More filling would make them much better."}
{"text":"The food and service here is GREAT.  The manager Josh took great care of us on our first visit, and again when we returned to get some take out salads to bring to a friend's bbq.  \nEverything about our experience with this restaurant was positive, and the prices are very reasonable."}
{"text":"Staying in the Brandywine Valley and came here for the first night of our visit.  Greeted by the chef owner's wife.  Lovely chat and our BYOB wine was poured. The menu is inventive using fresh local ingredients.  At our table was the interesting and tasty roasted romaine salad and their sublime mushroom soup. For entrees we had the duck with cherry sauce, veal madeira, short rib stroganoff and chicken with pasta.  Everyone loved their dish.  All meat soft and tasty though the veal was a bit tough and stringy yet it was smothered in yummy mushrooms and the duck was juicy  If you actually have room (the portions are ample) the desserts are luscious."}
{"text":"The food was great! I was pleased to see the eco friendly steps you all have taken. However, I was confused by the three separate plates. One for my toast, one for my eggs, and one for the bacon. You would save on water if you changed this practice."}
{"text":"Tara is the most considerate bartender. And they are rare. She takes her time and answers questions about all questions about beers and alcohols."}
{"text":"Doesn't look much when you walk past  but I was dying out of hunger so I popped in. Well, that was the best decision. I found my favorite Indian restaurant in Tennessee. The food, staffs, environment everything is fantastic. I had the goat curry with garlic naan. The curry was exactly how I was wishing it to be. Everyone must try this restaurant."}
{"text":"Disappointing. There is so much hype about this place, that I came in expecting to love it, but was let down with every dish. \n\nWhile it is clearly excellent quality food and beautiful presentation, portions were too small and flavors didn't stand out as much as I was expecting. It was an entirely forgettable meal. \n\nAlso annoying was that they sat us in the upstairs room despite their being downstairs tables available because (I believe) we were not local. \n\nIt paled in comparison to places like Cochon, Peche and August."}
{"text":"Sakura is my go-to place for sushi.  It's tasty and the 50% off menu is fantastic.  I stop regularly for take-out on my way home from work.  I have never eaten there but it's always busy and the atmosphere is nice."}
{"text":"There's something very unique and great about this place which I still couldn't figure out. Apparently, it's a small Mediterranean fast food place mostly serving students as the prices are very reasonable. But the food is soo good. Chicken maharoosh, cheese steak, kafta kabob, lamb shawarma and the humus are the best. If you are my best friend and you are coming from far away to see me for only a couple of days and I've to pick a spot to eat from ill pick this place in a heartbeat, no questions asked. The owner is a friendly guy. They don't accept credit cards. They have weird timings though, they are closed on Sundays and during the week days they close around 10. But it's the only place where you can go after a long weary day and order food and by the time you come out, you will feel rewarded."}
{"text":"So I may be slightly biased, but I used to work at a Benihana's in Harrisburg when I was 15, and my mom worked there for about 20 years and a handful of uncles worked there.  The prices here are typical for hibachi I think.  The one complaint I have is that while at other hibachi places, your meal usually comes with fried rice, I believe you have to pay extra for the fried rice here.  Also, I'm not sure if Hilary P requested miso specifically... but everytime I've gone to a Benihana, they usually serve onion soup as part of the combo deal.  I got the hibachi steak - delicious and large pieces, unlike some other ones I've gone to.  Also, not sure if it was a promo or what, but everyone at the table got a free sample of shrimp.  As far as sushi goes, it was actually quite good.\n\nService was alright... my only complaint was that she brought out my spicy tuna roll towards the end of the meal, and didn't really bother until AFTER I asked about it.  And our chef was alright.  He was somewhat entertaining... but after hearing all the excitement and clapping from other tables, I think our table might have gotten shafted.\n\nI say 3.5 stars.  Maybe I'll bump it to a 4 at the next outting!"}
{"text":"I got the cheesesteak.  It was a little bland but you can't hate on anyone with military stuff and with a can of soda it was only $10.02. I will go to the original Thunderbird. I also want to try the cheesesteak rollettes."}
{"text":"I went here for my birthday dinner and it was a great decision! The food was excellent and the service was even better! Very friendly and personable. The atmosphere is also very nice. No complaints at all. I can't wait to go back!"}
{"text":"Would think service should be top notch when less than half of tables are full on a Friday night. Paid $21 for a steak that was awful, and the best part was my baked potato looked like it sat in the warming drawer for 3 days and the server just placed my plate down and smiled. You know she, expeditor and cooks all saw that nasty brown potato and did nothing about it! My wifes $10 burger was fine. \n\nWe've eaten at this restaurant dozens of times but overall a pretty sub-par experience. Where is the manager? Such wasted opportunity and easy fixes but does require some management."}
{"text":"I hate to write a less-than-enthusiastic review for a place I have liked very much for a number of years, but I hope some constructive criticism will lead to improvements. First of all, the place could have been cleaner. Where we were sitting there was icing on the floor and crumbs all over the chairs. OK I don't expect them to clean the floor while customers are there, but they never even dusted off the chairs we weren't using, or wiped the table. As if acknowledging how dirty the table was, the server didn't even want to place the silverware on it. (Thanks for that anyway). Clean it? Nope. Also, although the staff were pleasant they seemed a bit clueless and couldn't tell one customer from another. A server tried to give us someone else's takeout order, and our server greeted us by asking if we were finished. The food, which in past was very good, was merely OK. Bread served with eggs was very skimpy. We were never offered more water. And to top it all off, they charged $3 extra for changing the cheese in an omelet. It's not a lot, but it's petty and customer-unfriendly when they're already charging 12 bucks and there is no extra work involved and Swiss cheese cannot possibly be that expensive.  A big disappointment."}
{"text":"I made a reservation here for the first night of SJ Restaurant Week. It was a great deal - $35 per person for a 4 course pre fixe meal. I was very happy with the dishes I had selected. I did get the NY Strip as my main course and it was amazing! Another thing that was really good was the bourbon cheesecake.  Never had anything like it.  My husband got the brownie sundae which we were going to share but I actually passed up the brownie sundae to eat all of the cheesecake.  It was THAT good.  \n\nThe waitstaff was friendly and courteous too.  I would come here again for a special occasion or a night out alone with the hubby."}
